app/controllers/likes_controller.rb

INSERT INTO "likes" ("created_at", "updated_at", "user_id", "post_id") VALUES (?, ?, ?, ?)  [["created_at", "2022-04-08 08:04:58.401804"], ["updated_at", "2022-04-08 08:04:58.401804"], ["user_id", 1], ["post_id", 1]]
---
    def create
      debugger

      @like = @post.likes.build
      @like.user = current_user
      @like.save!