app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["body", "daw"], ["created_at", "2022-04-05 06:38:58.164225"], ["updated_at", "2022-04-05 06:38:58.164225"], ["user_id", 1]]
---
  def create
    @post = current_user.posts.build(post_params)

    if @post.save